app/controllers/foods_controller.rb

  def get_foods_by_order
    @foods = Food.where({order_id: params[:order_id]})
---
SELECT "foods".* FROM "foods" WHERE "foods"."order_id" = 3

  def create
    @food = Food.new(params[:food])

    respond_to do |format|
      if @food.save
---
INSERT INTO "foods" ("cost", "created_at", "delivered", "number", "order_id", "summary", "title", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def update
    @food = Food.find(params[:id])

    respond_to do |format|
      if @food.update_attributes(params[:food])
---
SELECT "foods".* FROM "foods" WHERE "foods"."id" = $1 LIMIT 1  [["id", "3"]]
UPDATE "foods" SET "number" = 2, "summary" = 28, "updated_at" = '2013-04-14 15:32:25.140075' WHERE "foods"."id" = 3