app/controllers/orders_controller.rb

SELECT "orders".* FROM "orders" WHERE "orders"."table_id" = 2 AND "orders"."status" = 'opened' LIMIT 1
---
  def get_order_by_table
    @order = Order.where({table_id: params[:table_id], status: 'opened'}).first();

INSERT INTO "orders" ("created_at", "status", "table_id", "total", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Sun, 14 Apr 2013 15:30:44 UTC +00:00], ["status", "opened"], ["table_id", 0], ["total", 10], ["updated_at", Sun, 14 Apr 2013 15:30:44 UTC +00:00]]
---
  def create
    @order = Order.new(params[:order])

    respond_to do |format|
      if @order.save

SELECT "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT 1  [["id", "2"]]
UPDATE "orders" SET "status" = 'cancelled', "updated_at" = '2013-04-14 15:33:02.068136' WHERE "orders"."id" = 2
---
  def update
    @order = Order.find(params[:id])

    respond_to do |format|
      if @order.update_attributes(params[:order])