app/controllers/tables_controller.rb

  def index
    @tables = Table.order("tables.name asc")
---
SELECT "tables".* FROM "tables" ORDER BY tables.name asc

  def update
    @table = Table.find(params[:id])

    respond_to do |format|
      if @table.update_attributes(params[:table])
---
SELECT "tables".* FROM "tables" WHERE "tables"."id" = $1 LIMIT 1  [["id", "1"]]
UPDATE "tables" SET "status" = 'busy', "updated_at" = '2013-04-14 15:32:57.173265' WHERE "tables"."id" = 1