app/controllers/waiters_controller.rb

  def index
    @waiters = Waiter.all
---
SELECT "waiters".* FROM "waiters"